[
  {
    "id": "mucuna_01_intro",
    "source_doc_id": "extension_brief_mucuna.pdf",
    "chunk_index": 1,
    "section_heading": "Velvet bean description",
    "journal": "ILRI extension brief",
    "publish_year": 2016,
    "usage_count": 42,
    "attributes": [
      "Botanical description",
      "Morphology"
    ],
    "link": "https://cgspace.cgiar.org/server/api/core/bitstreams/68bfaec0-8d32-4567-9133-7df9ec7f3e23/content",
    "text": "Velvet bean–Mucuna pruriens var. utilis, also known as mucuna—is a twining annual leguminous vine common to most parts of the tropics. Its growth is restricted to the wet-season as it dies at the onset of the cold season. It has large trifoliate leaves (i.e. has three leaflets) and very long vigorous twining stems that can extend over two–three metres depending on growth conditions. When planted at the beginning of the growing season, flowers normally form at the end of March/early April. These flowers are deep purple and appear underneath the foliage. Seeds are large, ovoid shaped (±10 mm long) and of different colours, ranging from white, grey, brown to black and mottled."
  },
  {
    "id": "mucuna_02_why_grow_1",
    "source_doc_id": "extension_brief_mucuna.pdf",
    "chunk_index": 2,
    "section_heading": "Why grow the velvet bean? (part 1)",
    "journal": "ILRI extension brief",
    "publish_year": 2016,
    "usage_count": 35,
    "attributes": [
      "Soil fertility",
      "Green manure",
      "Cover crop"
    ],
    "link": "https://cgspace.cgiar.org/server/api/core/bitstreams/68bfaec0-8d32-4567-9133-7df9ec7f3e23/content",
    "text": "The velvet bean can be grown for soil fertility, green manure and as a cover crop in conservation agriculture (CA). The velvet bean is a high yielding leguminous forage crop—high in nitrogen (N)/crude protein content. It is usually sown as an N-fixing ley crop or as a green manure crop to improve soil fertility. In the sub-humid regions it can be intercropped with maize to improve soil fertility, maximize grain/herbage yields per unit area and provide mixed crop for hay/silage making. Whether it is grown as a single or mixed crop, the velvet bean provides early dry season grazing or fodder for hay or mixed-crop silage, improving the N content of cereal or grass silage."
  },
  {
    "id": "mucuna_03_why_grow_2",
    "source_doc_id": "extension_brief_mucuna.pdf",
    "chunk_index": 3,
    "section_heading": "Why grow the velvet bean? (part 2)",
    "journal": "ILRI extension brief",
    "publish_year": 2016,
    "usage_count": 28,
    "attributes": [
      "Feed value",
      "Seed protein"
    ],
    "link": "https://cgspace.cgiar.org/server/api/core/bitstreams/68bfaec0-8d32-4567-9133-7df9ec7f3e23/content",
    "text": "The hay and silage can be used as supplementary feed during the dry season to improve the digestibility of poor quality roughages, such as maize stover. Mucuna is a prolific seeder and its seed (26 % crude protein) can be used in home-mixed rations to replace commercial supplements. However, its grain is not so useful to non-ruminant livestock. It can only be used for human consumption after reducing its toxicity by boiling and discarding the water several times."
  }
]